<a href="https://colab.research.google.com/github/lejaaprianza/Belajar-Pandas-Python/blob/main/Pandas_tutorial_dari_Indonesia_Belajar.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas 01 | Menyertakan Prefix dan Suffix pada seluruh Kolom Pandas Data Frame | Python Pandas

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.5
1.19.5

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)), columns = cols)

df

   A  B  C  D  E
0  8  5  3  2  1
1  9  6  7  4  8
2  2  3  6  8  7
3  2  8  1  2  2
4  8  6  6  9  2

In [ ]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [ ]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        8        5        3        2        1
1        9        6        7        4        8
2        2        3        6        8        7
3        2        8        1        2        2
4        8        6        6        9        2

In [ ]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        8        5        3        2        1
1        9        6        7        4        8
2        2        3        6        8        7
3        2        8        1        2        2
4        8        6        6        9        2

#Pandas 02 | Pemilihan baris (rows selection) pada Data Frame | Python Pandas | Data Science

In [ ]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5,size=(n_rows,n_cols)), columns = cols)

df

   A  B  C  D  E
0  3  3  2  4  1
1  4  1  4  4  3
2  1  2  4  3  2
3  2  3  2  2  3
4  1  3  3  4  1
5  3  4  4  4  1
6  4  3  2  2  2
7  3  2  1  4  1
8  2  1  1  4  1
9  3  4  1  3  2

In [ ]:
df[(df['A']==1)|(df['A']==3)]

   A  B  C  D  E
0  3  3  2  4  1
2  1  2  4  3  2
4  1  3  3  4  1
5  3  4  4  4  1
7  3  2  1  4  1
9  3  4  1  3  2

In [ ]:
df[df['A'].isin([4,5,1])]

   A  B  C  D  E
1  4  1  4  4  3
2  1  2  4  3  2
4  1  3  3  4  1
6  4  3  2  2  2

In [ ]:
df[~df['A'].isin([4])]

   A  B  C  D  E
0  3  3  2  4  1
2  1  2  4  3  2
3  2  3  2  2  3
4  1  3  3  4  1
5  3  4  4  4  1
7  3  2  1  4  1
8  2  1  1  4  1
9  3  4  1  3  2

#Pandas 03 | Konversi tipe data String ke Numerik pada kolom Data Frame | Python Pandas

##**Persiapan Data Frame**

In [2]:
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [4]:
df.dtypes

col1    object
col2    object
dtype: object

##**Konversi tipe data dengan fungsi astype()**

In [5]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [6]:
df_x.dtypes

col1    object
col2     int64
dtype: object

##**Konversi tipe data numerik dengan fungsi to_numeric()**

In [7]:
df.apply(pd.to_numeric,errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4